chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usbhs/processor/usbhs_p32mz2048efm100.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _USBHS_P32MZ2048EFM100_H
#define _USBHS_P32MZ2048EFM100_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    USBHS_ID_0 = 0,
    USBHS_NUMBER_OF_MODULES

} USBHS_MODULE_ID;

typedef enum {

    USBHS_TXRXINT_EP0 = 0x01,
    USBHS_TXRXINT_EP1 = 0x02,
    USBHS_TXRXINT_EP2 = 0x04,
    USBHS_TXRXINT_EP3 = 0x08,
    USBHS_TXRXINT_EP4 = 0x10,
    USBHS_TXRXINT_EP5 = 0x20,
    USBHS_TXRXINT_EP6 = 0x40,
    USBHS_TXRXINT_EP7 = 0x80,
    USBHS_TXRXINT_ANY = 0xFF,
    USBHS_TXRXINT_ALL = 0xFF

} USBHS_EPTXRX_INTERRUPT;

typedef enum {

    USBHS_GENINT_SUSPEND = 0x01,
    USBHS_GENINT_RESUME = 0x02,
    USBHS_GENINT_RESET = 0x04,
    USBHS_GENINT_BABBLE = 0x04,
    USBHS_GENINT_SOF = 0x08,
    USBHS_GENINT_DEVCONN = 0x10,
    USBHS_GENINT_DEVDISCONN = 0x20,
    USBHS_GENINT_DEVSESSEND = 0x20,
    USBHS_GENINT_SESSIONREQ = 0x40,
    USBHS_GENINT_VBUSERR = 0x80,
    USBHS_GENINT_ANY = 0xFF,
    USBHS_GENINT_ALL = 0xFF

} USBHS_GEN_INTERRUPT;

typedef enum {

    USBHS_EP0_ERROR_NAK_TIMEOUT = 0x80,
    USBHS_EP0_ERROR_BUS = 0x10,
    USBHS_EP0_ERROR_RXSTALL = 0x04,
    USBHS_EP0_ERROR_ANY = 0x94,
    USBHS_EP0_ERROR_ALL = 0x94

} USBHS_EP0_ERROR;

typedef enum {

    USBHS_TXEP_ERROR_NAK_TIMEOUT = 0x80,
    USBHS_TXEP_ERROR_INCOMP_TX = 0x80,
    USBHS_TXEP_ERROR_BUS = 0x04,
    USBHS_TXEP_ERROR_RXSTALL = 0x20,
    USBHS_TXEP_ERROR_ANY = 0xA4,
    USBHS_TXEP_ERROR_ALL = 0xA4

} USBHS_TXEP_ERROR;

typedef enum {

    USBHS_RXEP_ERROR_NAK_TIMEOUT = 0x08,
    USBHS_RXEP_ERROR_ISO_DATA = 0x08,
    USBHS_RXEP_ERROR_BUS = 0x04,
    USBHS_RXEP_ERROR_RXSTALL = 0x40,
    USBHS_RXEP_ERROR_ANY = 0x4C,
    USBHS_RXEP_ERROR_ALL = 0x4C

} USBHS_RXEP_ERROR;

typedef enum {

    USBHS_VBUS_SESSION_END = 0x00,
    USBHS_VBUS_BELOW_AVALID = 0x08,
    USBHS_VBUS_BELOW_VBUSVALID = 0x10,
    USBHS_VBUS_VALID = 0x18

} USBHS_VBUS_LEVEL;

typedef enum {

    USBHS_EP0_RXPKTRDY = 0x01,
    USBHS_EP0_TXPKTRDY = 0x02,
    USBHS_EP0_SENTSTALL = 0x04,
    USBHS_EP0_SETUPEND = 0x10

} USBHS_DEVICE_EP0_STATUS;

typedef enum {

    USBHS_TXEP_FIFONOTEMPTY = 0x02,
    USBHS_TXEP_UNDERRUN = 0x04,
    USBHS_TXEP_SENTSTALL = 0x20,
    USBHS_TXEP_INCOMPTX = 0x80

} USBHS_DEVICE_TXEP_STATUS;

typedef enum {

    USBHS_RXEP_PKTRDY = 0x01,
    USBHS_RXEP_FIFOFULL = 0x02,
    USBHS_RXEP_OVERRUN = 0x04,
    USBHS_RXEP_DATAERROR = 0x08,
    USBHS_RXEP_SENTSTALL = 0x40

} USBHS_DEVICE_RXEP_STATUS;

PLIB_INLINE SFR_TYPE* _USBHS_BASE_ADDRESS_VREG(USBHS_MODULE_ID i)
{
    switch (i) {
        case USBHS_ID_0 :
            return &USBCSR0;
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USBHS_FIFO_BASE_ADDRESS_VREG(USBHS_MODULE_ID i)
{
    switch (i) {
        case USBHS_ID_0 :
            return &USBFIFO0;
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USBHS_TARGET_CONTROL_BASE_ADDRESS_VREG(USBHS_MODULE_ID i)
{
    switch (i) {
        case USBHS_ID_0 :
            return &USBE0TXA;
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USBHS_ENDPOINT_BASE_ADDRESS_VREG(USBHS_MODULE_ID i)
{
    switch (i) {
        case USBHS_ID_0 :
            return &USBE0CSR0;
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USBHS_CLOCK_RESET_USB_INTERRUPT_ENABLE_VREG(USBHS_MODULE_ID i)
{
    switch (i) {
        case USBHS_ID_0 :
            return &USBCRCON;
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_DATA _USBHS_BASE_ADDRESS_MASK(USBHS_MODULE_ID i)
{
    switch (i) {
        case USBHS_ID_0 :
            return _USBCSR0_EP0IF_MASK;
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USBHS_FIFO_BASE_ADDRESS_MASK(USBHS_MODULE_ID i)
{
    switch (i) {
        case USBHS_ID_0 :
            return _USBFIFO0_DATA_MASK;
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USBHS_TARGET_CONTROL_BASE_ADDRESS_MASK(USBHS_MODULE_ID i)
{
    switch (i) {
        case USBHS_ID_0 :
            return _USBE0TXA_TXHUBPRT_MASK;
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USBHS_ENDPOINT_BASE_ADDRESS_MASK(USBHS_MODULE_ID i)
{
    switch (i) {
        case USBHS_ID_0 :
            return _USBE0CSR0_DTWE_MASK;
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USBHS_CLOCK_RESET_USB_INTERRUPT_ENABLE_MASK(USBHS_MODULE_ID i)
{
    switch (i) {
        case USBHS_ID_0 :
            return _USBCRCON_USBIE_MASK;
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USBHS_BASE_ADDRESS_POS(USBHS_MODULE_ID i)
{
    switch (i) {
        case USBHS_ID_0 :
            return _USBCSR0_EP0IF_POSITION;
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USBHS_FIFO_BASE_ADDRESS_POS(USBHS_MODULE_ID i)
{
    switch (i) {
        case USBHS_ID_0 :
            return _USBFIFO0_DATA_POSITION;
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USBHS_TARGET_CONTROL_BASE_ADDRESS_POS(USBHS_MODULE_ID i)
{
    switch (i) {
        case USBHS_ID_0 :
            return _USBE0TXA_TXHUBPRT_POSITION;
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USBHS_ENDPOINT_BASE_ADDRESS_POS(USBHS_MODULE_ID i)
{
    switch (i) {
        case USBHS_ID_0 :
            return _USBE0CSR0_DTWE_POSITION;
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USBHS_CLOCK_RESET_USB_INTERRUPT_ENABLE_POS(USBHS_MODULE_ID i)
{
    switch (i) {
        case USBHS_ID_0 :
            return _USBCRCON_USBIE_POSITION;
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USBHS_BASE_ADDRESS_LEN(USBHS_MODULE_ID i)
{
    switch (i) {
        case USBHS_ID_0 :
            return _USBCSR0_EP0IF_LENGTH;
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USBHS_FIFO_BASE_ADDRESS_LEN(USBHS_MODULE_ID i)
{
    switch (i) {
        case USBHS_ID_0 :
            return _USBFIFO0_DATA_LENGTH;
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USBHS_TARGET_CONTROL_BASE_ADDRESS_LEN(USBHS_MODULE_ID i)
{
    switch (i) {
        case USBHS_ID_0 :
            return _USBE0TXA_TXHUBPRT_LENGTH;
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

